{"checksum": "7a40e60806476574546dd4e1c031586041dc66451d862f7a9d6f48cc5989ddf7", "timestamp": 1360074251, "items": [{"end": "09:45", "room": "#Lecture room D1", "language": "EN", "tags": ["Security"], "timestamp": 1361606400, "topic": "Petr Lautrbach - openssh in Fedora and RHEL - internal, features, ...", "start": "09:00", "speaker": "Petr Lautrbach", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361609100, "type": "talk", "description": "<p>OpenSSH is free version of SSH. This talk will be about <br /> <br />- the architecture of ssh protocol <br />- openssh features like channel multiplexing and privilege separation <br />- Fedora and RHEL improvements like SELinux integration, auditing</p>\r\n<p>&nbsp;</p>"}, {"end": "09:45", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361606400, "topic": "Lukáš Fryč, Dan Allen, Aslak Knutsen - Beam me up! A tour around the Arquillian Universe", "start": "09:00", "speaker": "Lukáš Fryč, Aslak Knutsen, Dan Allen", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361609100, "type": "talk", "description": "<p>Arquillian is an innovative and highly extensible testing platform for <br />the JVM that enables developers to easily create automated integration, <br />functional and acceptance tests for Java middleware, from Java EE and <br />beyond.<br /><br />In this presentation, the Arquillian project leads will lay out where <br />the Arquillian project is headed and how it fits into the Arquillian <br />Universe. We'll focus on the \"highly extensible\" part, one of <br />Arquillian's proven strengths. Arquillian was designed with the ability <br />to change its default behavior via its powerful extension model. <br />Extensions are portals through which Arquillian can travel to take on <br />challenges in new domains or those yet to be realized. <br /><br />You'll get a overview of what extensions and extension points are <br />available today, what ideas are starting to take shape in the community <br />and how we plan to expand the Arquillian Universe to improve the overall <br />quality of the testing stack, from Java and beyond.</p>"}, {"end": "09:45", "room": "#Lecture room D3", "language": "EN", "tags": ["Desktop"], "timestamp": 1361606400, "topic": "Kai-Uwe Behrmann - Future of Colour Management on the Linux Desktop", "start": "09:00", "speaker": "Kai-Uwe Behrmann", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361609100, "type": "talk", "description": "<p>Colour Management had a long way to come on desktops. What will be the path for Linux? What is special compared to other platforms?</p>"}, {"end": "10:30", "room": "Hackfest Lab 1", "language": "EN", "tags": ["Core OS"], "timestamp": 1361606400, "topic": "Daniel Vratil, Jaroslav Reznik - Introduction to QML", "start": "09:00", "speaker": "Daniel Vrátil, Jarda \"rezza\" Řezník", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361611800, "type": "talk", "description": "<p>We will cover basic concepts of QML, explain how to create a modern GUI with animations, state transitions and user interaction. No knowledge of C&nbsp;&nbsp; or Qt is necessary.</p>"}, {"end": "10:30", "room": "Hackfest Lab 2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361606400, "topic": "Pavel Tisnovsky - JVM Monitoring Tools", "start": "09:00", "speaker": "Pavel Tišnovský", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361611800, "type": "talk", "description": "<p>A brief description of various tools which can be used to monitor Java virtual machine (JVM) and also applications running on JVM. We will discuss CLI-based tools and also tools with graphical user interface, especially project Thermostat and JConsole.</p>"}, {"end": "14:00", "room": "Meeting point 1", "language": "EN", "tags": ["Documentation"], "timestamp": 1361606400, "topic": "Florian Nadge - Gnome Doc Sprint #1", "start": "09:00", "speaker": "GNOME Doc Sprint", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361624400, "type": "talk", "description": "N/A"}, {"end": "12:00", "room": "Meeting point 2", "language": "EN", "tags": ["Core OS"], "timestamp": 1361606400, "topic": "Jan Zeleny - Packaging workshop", "start": "09:00", "speaker": "Jan Zeleny", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361617200, "type": "talk", "description": "<p>Packaging workshop for RPM and YUM hackers</p>"}, {"end": "10:35", "room": "#Lecture room D1", "language": "EN", "tags": ["Security"], "timestamp": 1361609400, "topic": "Simo Sorce - GSSAPI Privilege separation with GSS-Proxy", "start": "09:50", "speaker": "Simo Sorce", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361612100, "type": "talk", "description": "<p>GSS-Proxy is a new feature developed in collaboration with the Mit Kerberos Project.<br />It allows to use an new type of plugin called interposer to offload context establishment to a more privileged process without changeing the GSS API.<br />This allows to use, for example, kerberos credentials in a process without giving direct access to keytabs or credential caches containing the user TGT.<br />This talk will explain how this is achieved, and what are the applications, advantages and limitations of the current implementation.<br />Using the GSS-Proxy protocol as a kernel upcall mechanism to handle GSS auth will also be discussed.</p>"}, {"end": "10:35", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361609400, "topic": "Lukáš Fryč, Ondra Skutka - Developing Mobile Applications with AeroGear", "start": "09:50", "speaker": "Lukáš Fryč, Ondřej Skutka", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361612100, "type": "talk", "description": "<p>Web/Native/Hybrid application development for mobile devices</p>"}, {"end": "10:35", "room": "#Lecture room D3", "language": "EN", "tags": ["Desktop"], "timestamp": 1361609400, "topic": "Debarshi Ray - GNOME Online Accounts: for users and hackers", "start": "09:50", "speaker": "Debarshi Ray", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361612100, "type": "talk", "description": "<p>GNOME Online Accounts provides interfaces so that applications and libraries in GNOME can access the user's online accounts. It has providers for Google, ownCloud, Facebook, Flickr, Windows Live, Microsoft Exchange and Kerberos. I am going to cover the following main points in this talk:<br /><br />(i) The new features that are being lined up for GNOME 3.8. Showcase some of the existing applications (eg., Documents, Empathy, Evolution) that leverage GOA.<br /><br />(ii) How can application developers pick up the information provided by GNOME Online Accounts to achieve tighter integration with the desktop? What to expect from GOA, and what not to.<br /><br />(iii) Problems encountered while interacting with providers -- current issues with supporting Google 2-factor authentication.</p>"}, {"end": "11:25", "room": "#Lecture room D1", "language": "EN", "tags": ["Security"], "timestamp": 1361612400, "topic": "Martin Preisler, Simon Lukasik - System compliance checks", "start": "10:40", "speaker": "Martin Preisler, Šimon Lukašík", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361615100, "type": "talk", "description": "<p>System compliance checks based on SCAP specifications. What we provide for Desktop and Enterprise systems. Demonstrate the work-flow. Talk about challenges and plans.</p>"}, {"end": "11:25", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361612400, "topic": "Christian Sadilek, Pavel Šlégr - Taming the Spaghetti: Rich Web Applications with Errai", "start": "10:40", "speaker": "Christian Sadilek, Pavel Šlégr", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361615100, "type": "talk", "description": "<p>In today&rsquo;s Web applications, the complexity of the code written for the browser rivals the complexity of the server-side code. Errai brings proven server-side programming models to the browser and offers a concise way for building next-generation Web applications by combining the best of two worlds: JavaScript and Java. In this talk, we will demonstrate how to build rich Web applications the toolable, typesafe way and without boilerplate.</p>"}, {"end": "11:25", "room": "#Lecture room D3", "language": "EN", "tags": ["Fedora"], "timestamp": 1361612400, "topic": "Tom Callaway - Improving the Fedora User Experience with Design Driven Methodology", "start": "10:40", "speaker": "Tom Callaway", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361615100, "type": "talk", "description": "<p>This presentation will briefly go over a proposal on a set of solutions to improve the Fedora User Experience. Fedora is a contributor driven community, but all contributors are users, thus, it is vital to aggressively and proactively grow the user base and the best way to do that is to provide users with something that is easy to use, powerful in functionality, and reliable. At the same time, Fedora is a fast moving distribution which prides itself on being an early adopter of technology. I believe that our community adopts and embraces a strategy of design driven methodology, we can provide an excellent User Experience in Fedora without sacrificing Fedora's core ideals.</p>"}, {"end": "12:10", "room": "Hackfest Lab 1", "language": "EN", "tags": ["Core OS"], "timestamp": 1361612400, "topic": "Bohuslav Kabrda - Flask Framework Basics", "start": "10:40", "speaker": "Bohuslav Kabrda", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361617800, "type": "talk", "description": "<p>Flask [http://flask.pocoo.org/]&nbsp;is a Python microframework based on Jinja2 and Werkzeug. This lab will show you how to create a simple dynamic web application in Flask and how to use it with SQLAlchemy to persist data.<br />Preferred language: English, but Czech is absolutely ok, too.</p>"}, {"end": "12:10", "room": "Hackfest Lab 2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361612400, "topic": "Pavel Macík, Martin Večeřa - Bite your code with Byteman", "start": "10:40", "speaker": "Pavel Macík, Martin Večeřa", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361617800, "type": "talk", "description": "<p>An introduction to bytecode manipulaton, how to inject code using Byteman to debug race conditions, and how to simulate exceptional conditions in application testing.</p>"}, {"end": "12:15", "room": "#Lecture room D1", "language": "EN", "tags": ["Security"], "timestamp": 1361615400, "topic": "Dmitri Pal & Simo Sorce - Integrating Linux systems into Active Directory Environment", "start": "11:30", "speaker": "Simo Sorce, Dmitri Pal", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361618100, "type": "talk", "description": "<p>Integrating Linux into Active Directory environment is a challenging task. There are multiple factors that need to be taken into the account and multiple options to consider. The talk would cover different solutions that can be implemented to integrate Linux systems into the AD environment and discuss factors that affect decision making.</p>"}, {"end": "12:15", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361615400, "topic": "Lukasz Dywicki - Application integration with SwitchYard", "start": "11:30", "speaker": "Lukasz Dywicki", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361618100, "type": "talk", "description": "<p>\"In the not too distant past, application integration was widely considered to be a post-deployment consideration.&nbsp; Development teams implemented business logic and packaged their application for deployment, while system integrators came in after the fact to tie applications together.&nbsp; With the introduction of Service Oriented Architecture, we began to see a shift where the design and implementation of a service was guided by a desire for application logic to be be used in multiple contexts and to take advantage of services offered by other applications without tightly coupling the implementations.&nbsp; One of the biggest challenges for developers, however, was how to realize the tangible benefits of SOA without getting swallowed by the tools and frameworks designed to get them there.<br /><br />This session provides an in-depth tour of how SwitchYard, the next generation Enterprise Service Bus from JBoss, gets you to SOA, easy.&nbsp; There's something for everyone in this talk. Java EE developers will see how a small set of annotations can be used to turn CDI beans into providers and consumers of enterprise services. Inject references to enterprise services directly into your Java EE web applications! Application integrators will witness the wonder of declarative transformation, the flexibility of policy-based service constrains, and the power of an Apache Camel-based routing engine with tons of EIP. Business savvy folks will find multiple options for service orchestration including BPMN 2.0 and BPEL. In the end, everyone wins when these features are tied together with rapid application development tooling, a consistent, standards-based configuration model, a top-notch testing framework, and deployment options ranging from embedded to cloud.\"</p>"}, {"end": "12:15", "room": "#Lecture room D3", "language": "EN", "tags": ["Fedora"], "timestamp": 1361615400, "topic": "Leslie Hawthorn - Negotiation theory for Open Source Hackers", "start": "11:30", "speaker": "Leslie Hawthorn", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361618100, "type": "talk", "description": "<p>The best Open Source hackers are great at the \"soft skills\" related to hacking - resolving conflict, gathering support around a direction for the project, and understanding what the user *really* wants in a bug report. Every feature request and implementation discussion, bug report and mailing list thread is a negotiation.<br /><br />There is a well established, common sense, very effective way to think of negotiations which will help you improve as a developer, and make your project better at the same time, from the Harvard Negotiation Project. Using this theory, you will be able to get better outcomes when dealing with frustrated users, colleagues and bosses. You can even apply the principles to domestic debates, wage negotiations and dealing with used car salesmen.</p>"}, {"end": "13:15", "room": "#Lecture room D1", "language": "EN", "tags": ["System management"], "timestamp": 1361619000, "topic": "Tomas Smetana - System Management with CIM and OpenLMI", "start": "12:30", "speaker": "Tomáš Smetana", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361621700, "type": "talk", "description": "<p>Mild introduction to CIM, WBEM and DMTF standards and their application to systems management and monitoring.<br /><br />Introduction of the OpenLMI project: the providers, the tools and why the sysadmins should pay attention to the project development.</p>"}, {"end": "13:15", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361619000, "topic": "Koen Aers - Raise Your Java EE 6 Productivity Bar With JBoss Forge", "start": "12:30", "speaker": "Koen Aers", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361621700, "type": "talk", "description": "<p>Getting started with Java EE development can, despite the important improvements over time, still be quite daunting for newbies. Putting a JSF application to work, setting up persistence or enabling restful web services are not trivial tasks.&nbsp; <br />JBoss Forge is a versatile and lean development environment entirely written in Java and making smart use of CDI. Its purpose is to offer you the possibility of incrementally working in new functionality into existing Java projects. It is a command-line oriented tool, so creating entities or scaffolding a user interface is just a matter of issuing a few commands. <br />But what if your task at hand cannot be done by Forge? No worries, as Forge operates by means of plug-ins, the answer is simply to look for an appropriate plugin or create it yourself if one is not available. <br />Finally, Forge can also be integrated in graphical IDE's opening up all its power to users of common platforms such as Eclipse.<br />Come to this session if you want to see this powerful tool live in action!</p>"}, {"end": "13:15", "room": "#Lecture room D3", "language": "EN", "tags": ["Core OS"], "timestamp": 1361619000, "topic": "Aleš Kozumplík - Hawkey and DNF: the next-gen Fedora Packaging tools", "start": "12:30", "speaker": "Aleš Kozumplík", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361621700, "type": "talk", "description": "<p>Summarizing the technology and progress made since the last developer conference. Discussing the current state of Hawkey and DNF (F18 is going to be out by February and DNF will be in the wild already), user experiences, main sticking points with customers in Fedora and RHEL worlds, status of the API. Possibly live demonstration (up to 5 min), invitation for people to join patching, cleaning up, documenting.</p>"}, {"end": "14:00", "room": "Hackfest Lab 1", "language": "EN", "tags": ["Cloud"], "timestamp": 1361619000, "topic": "Marek Jelen, Vojta Vitek – OpenShift", "start": "12:30", "speaker": "Marek Jelen, Vojtěch Vítek", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361624400, "type": "talk", "description": "<p><br /><br />* start with OpenShift - set up dev environment on the participant's machines, walk through basic concepts, creating first application, deploying the application, profit<br />* run your own PaaS - hands on setting your own OpenShift, setting up client environment, simple application, deployment to local and remote<br />* start hacking on OpenShift - walk through the code, components, project organization to enable the participant to start hacking on OpenShift (possible as talk as well)</p>"}, {"end": "14:00", "room": "Hackfest Lab 2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361619000, "topic": "Filip Nguyen - Enterprise Information Integration", "start": "12:30", "speaker": "Filip Nguyen", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361624400, "type": "talk", "description": "<p>The information is basic building block of Information Systems. All the middleware developed at JBoss are mostly tools to ease up the effort needed to manipulate the information. JBoss Teiid is very novel project that goes to the very core of the Information manipulation - Information Integration. In the talk, Filip Nguyen - JBoss Teiid contributor - will introduce basics of Teiid. Two demos will be shown in the talk and Filip will motivate Java developers to contribute into this bleeding edge project.</p>"}, {"end": "15:40", "room": "Meeting point 2", "language": "EN", "tags": ["Desktop"], "timestamp": 1361619000, "topic": "Jarda Reznik - Anaconda Usability sessions", "start": "12:30", "speaker": "Jarda \"rezza\" Řezník", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361630400, "type": "talk", "description": "<p>TBD</p>"}, {"end": "14:05", "room": "#Lecture room D1", "language": "EN", "tags": ["Kernel"], "timestamp": 1361622000, "topic": "Lukáš Czerner - Local kernel file systems update", "start": "13:20", "speaker": "Lukáš Czerner", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361624700, "type": "talk", "description": "<p>This talk will give you and overview on what is currently cooking in local Linux file systems and what has been done in the recent past. With btrfs getting stabilized, xfs gaining more traction, ext4 improvements, new storage capabilities and file system requirements we are in the exciting new era where it might be hard to keep on track with the recent development. This talk should get you a picture on where are we heading to, get you familiar with the new features and capabilities and give you an idea how to use them correctly.</p>"}, {"end": "14:05", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361622000, "topic": "Claus Ibsen - Getting Started with Apache Camel", "start": "13:20", "speaker": "Claus Ibsen", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361624700, "type": "talk", "description": "<p>This session will teach you how to get a good start with Apache Camel.<br /><br />We will introduce you to Apache Camel and how Camel its related to Enterprise Integration Patterns. And how you go about using these patterns in Camel routes, written in Java code or XML files.<br /><br />We will then discuss how you can get started developing with Camel, and how to setup a new project from scratch using Maven and Eclipse tooling. This session includes live demos that show how to build Camel applications in Java, Spring, OSGi Blueprint and alternative languages such as Scala and Groovy.<br /><br />You will also hear what other features Camel provides out of the box, which can make integration much easier for you.<br /><br />At the end we demonstrate how to build custom components, allowing you to build custom adapters if not already provided by Camel.<br /><br />Before opening up for QA, we will share useful links where you can dive into learning more about Camel.</p>"}, {"end": "14:05", "room": "#Lecture room D3", "language": "EN", "tags": ["Core OS"], "timestamp": 1361622000, "topic": "Michael Schroeder - OpenSUSE package management", "start": "13:20", "speaker": "Michael Schroeder", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361624700, "type": "talk", "description": "<p>This talk is about the package management stack in openSUSE and <br />its differences to Fedora. Package management is done through a<br />single library, libzypp, which itself uses the libsolv library<br />for dependency solving. Tools like zypper, YaST, or PackageKit<br />use libzypp to do the work, so the user always gets consistent<br />results.<br /><br />As weak dependencies like \"Recommends\" or \"Enhances\" are becoming<br />a hot topic for Fedora as well, the talk will show how they are an<br />essential part of package management in openSUSE. They are used for <br />various purposes, like automatic installation of plugins, support<br />for package splits, language dependent packages, and hardware<br />dependent packages.<br /><br />Another topic of interest is libzypp's vendor/arch locking mechanism.<br />Its purpose is to make sure installed packages do not switch to a<br />different vendor or architecture during an update, thereby losing<br />needed functionality. Libzypp also supports a \"distribution<br />update\" mode which turns off the update restrictions and tries to<br />emulate a fresh installation.<br /><br />The talk will conclude by having a look at some other differences<br />to Fedora, like the way multilib is implemented in openSUSE or<br />package metadata is updated via a zsync delta algorithm.</p>"}, {"end": "14:55", "room": "#Lecture room D1", "language": "EN", "tags": ["Kernel"], "timestamp": 1361625000, "topic": "Radek Pazdera - LNST - Automated and Portable Network Tests", "start": "14:10", "speaker": "Radek Pazdera", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361627700, "type": "talk", "description": "<p>In this presentation, we would like to introduce a tool we have been working on for the last couple of months. Our main goal is to make networking tests and reproducers as automated and portable as possible.<br /><br />We will demonstrate the ideas and the concepts we are working with, as well as the features that are a part of Linux Network Stack Test.</p>"}, {"end": "14:55", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361625000, "topic": "Guillaume Nodet - Overview of Fuse Fabric", "start": "14:10", "speaker": "Guillaume Nodet", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361627700, "type": "talk", "description": "<p>Fuse Fabric aims to provide an easy environment focused on deploying and managing large scale deployments of OSGi (Apache Karaf) based containers which is the base container for the Fuse products.<br />This talk will give an overview of the various concepts in Fabric and how it can be used to easily manage containers and deploy applications onto it, including rolling upgrades of applications.</p>"}, {"end": "14:55", "room": "#Lecture room D3", "language": "EN", "tags": ["Core OS"], "timestamp": 1361625000, "topic": "Marcela Mašláňová - Software Collections", "start": "14:10", "speaker": "Marcela Mašláňová", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361627700, "type": "talk", "description": "<p>What are we trying to solve by Software Collections. How is it related to rpm packaging (tools for packaging). Which collections are currently provided for our users. The presentation will give you an overview on this technology, overview of tools available in Fedora, what problems Software Collections can solve and future plans with them</p>"}, {"end": "15:40", "room": "Hackfest Lab 1", "language": "EN", "tags": ["Security"], "timestamp": 1361625000, "topic": "Daniel J Walsh - Writing SELinux Policy", "start": "14:10", "speaker": "Daniel J Walsh", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361630400, "type": "talk", "description": "<p>This lab/workshop will explain how to write SELinux policy.</p>"}, {"end": "15:40", "room": "Hackfest Lab 2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361625000, "topic": "Jan Papoušek, Juraj Húska - Testing web applications cheaply", "start": "14:10", "speaker": "Jan Papoušek, Juraj Húska", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361630400, "type": "talk", "description": "<p>Step by step instructions to write functional tests for web applications cheaply with use of Arquillian Graphene.</p>"}, {"end": "17:20", "room": "Meeting point 1", "language": "EN", "tags": ["Security"], "timestamp": 1361625000, "topic": "Stef Walter - Polished Active Directory Integration", "start": "14:10", "speaker": "Stef Walter", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361636400, "type": "talk", "description": "<p>Active Directory is widely used in enterprise environments, and Linux has had lots of projects, parts and pieces that could be used with Active Directory.<br /><br />In Fedora 18 we've integrated those parts into a polished experience. We'll discuss the new features in this talk.<br /><br />But it's not over, there's more to come. We'll show you how to get involved, and what's on the horizon for further Active Directory integration.<br /><br />Among other things we'll touch on sssd, realmd, and how they're used in Fedora and RHEL.<br /><br /><br /></p>"}, {"end": "15:45", "room": "#Lecture room D1", "language": "EN", "tags": ["Kernel"], "timestamp": 1361628000, "topic": "Jiří Olša - perf profiling", "start": "15:00", "speaker": "Jiří Olša", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361630700, "type": "talk", "description": "<p>Introducing performance events on linux and how to use then via perf for profiling.</p>"}, {"end": "15:45", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361628000, "topic": "Ondřej Krajíček, Jan Slezák  - Extending Scalability - Scaling Out with JBoss Infinispan and JBoss Drools", "start": "15:00", "speaker": "Ondrej Krajicek, Jan Slezák", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361630700, "type": "talk", "description": "<p>We have applied scalability techniques on the Y Soft SafeQ system to  extend the scalability of the system, scale out to thousands of nodes  and implement distributed system using JBoss Cache / Infinispan and  other technologies. We will discuss  the general principles applied and our experience with JBoss  Inifinspan, Drools. We will also provide references to customers using  the developed technology.</p>"}, {"end": "15:45", "room": "#Lecture room D3", "language": "EN", "tags": ["Core OS"], "timestamp": 1361628000, "topic": "Vratislav Podzmiek - The technology beyond Anaconda NewUI and 3rd party extensions for it", "start": "15:00", "speaker": "Vratislav Podzimek", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361630700, "type": "talk", "description": "<p>I would like to show the ideas and concepts behind the code that runs behind the Anaconda's new UI system. You will have a chance to learn about how we modularized the screens, moved to better data-UI separation and connected that to the rest of the anaconda submodules. I will also talk about the new firstboot and how it uses the new UI internals for sharing screens and achieving the same look and feel. The last part will discuss the API for 3rd party configuration and screens for anaconda and firstboot, which is something that was not possible before the rewrite and so is still under development.</p>"}, {"end": "17:15", "room": "Hackfest Lab 1", "language": "EN", "tags": ["Core OS"], "timestamp": 1361630700, "topic": "Vratislav Podzimek, Chris Lumens - Anaconda Public Discussion", "start": "15:45", "speaker": "Vratislav Podzimek, Chris Lumens", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361636100, "type": "talk", "description": "<p>Public discussions about future of disitribution installer. Most of the current Anaconda developers will be present including David Cantrell, Chris Lumens, Vratislav Podzimek, Dave Lehman, Radek Vykydal</p>"}, {"end": "17:15", "room": "Hackfest Lab 2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361630700, "topic": "Tomáš Repel, Lukáš Fryč - Gain on pace with JBoss Developer Framework", "start": "15:45", "speaker": "Lukáš Fryč, Tomáš Repel", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361636100, "type": "talk", "description": "<p>JBoss Developer Framework basics</p>"}, {"end": "17:15", "room": "Meeting point 2", "language": "EN", "tags": ["Core OS"], "timestamp": 1361630700, "topic": "Peter Hatina - How to use CIM and OpenLMI to manage your system", "start": "15:45", "speaker": "Peter Hatina", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361636100, "type": "talk", "description": "<p>Practical examples on how to use CIM/WBEM and OpenLMI on the command line and from scripts to manage a Linux system.</p>"}, {"end": "16:35", "room": "#Lecture room D1", "language": "EN", "tags": ["Kernel"], "timestamp": 1361631000, "topic": "Jesper Dangaard Brouer - Beyond the existences of Bufferbloat, have we found the cure?", "start": "15:50", "speaker": "Jesper Dangaard Brouer", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361633700, "type": "talk", "description": "<p>We have reached a point, where people have accepted bufferbloat does exist.&nbsp; Bufferbloat is the phenomenon of excessive network buffering causing high latency and jitter, as well as reducing the overall network throughput.&nbsp; But what about the solution?<br /><br />This talk is about, what techniques and solution we have (recently) implemented in the Linux kernel to mitigate (or solve?) bufferbloat.<br /><br />Subjects covered in detail are: TSQ (TCP Small Queue), BQL (Byte Queue Limit), CoDel (Controlled Delay active queue management).</p>"}, {"end": "16:35", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361631000, "topic": "James Strachan - Making Integration Easy via Tooling", "start": "15:50", "speaker": "James Strachan", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361633700, "type": "talk", "description": "<p>This talk will introduce the various tooling available to help developers use technologies like Apache Camel, ActiveMQ and Karaf to solve integration problems. The talk will focus on demonstrations of using tooling to create, run, modify and debug projects using Fuse IDE, the open source eclipse based tooling for the Fuse open source projects. James will also demonstrate the available web based tooling available.</p>"}, {"end": "16:35", "room": "#Lecture room D3", "language": "EN", "tags": ["Core OS"], "timestamp": 1361631000, "topic": "Adrian Schröter - Open Build Service, possible use cases for Fedora", "start": "15:50", "speaker": "Adrian Schröter", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361633700, "type": "talk", "description": "<p>The Open Build Service (OBS) is a free (GPL licensed) infrastructure piece for Open Source Communities and larger in-house product development.<br /><br />The session will show possible use cases including distribution development, continous integration, feature evaluation and more. This includes collaboration features between single developers in a local instance and collaboration between&nbsp; projects via remote OBS instances.<br /><br />I like to have also a BoF to discuss how Fedora could use OBS (or parts from it) and how package maintainership between openSUSE and Fedora could be improved.</p>"}, {"end": "17:25", "room": "#Lecture room D1", "language": "EN", "tags": ["Kernel"], "timestamp": 1361634000, "topic": "Daniel Borkmann - Linux' packet mmap(), BPF, and the netsniff-ng toolkit", "start": "16:40", "speaker": "Daniel Borkmann", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361636700, "type": "talk", "description": "<p>This talk will cover internals of the PF_PACKET socket in the Linux kernel, in particular the packet mmap() mechanism (\"zero-copy\") that is used to improve packet capturing and transmission performance from user space. In addition to that, the Berkeley Packet Filter will be partially covered with its built-in kernel space \"virtual machine\" and just-in-time compiler. As an application on top of that, the netsniff-ng toolkit will be presented (http://netsniff-ng.org/), which can be used to facilitate a network developer's daily kernel plumbing, but also the daily work of system administrators or security consultants.</p>"}, {"end": "17:25", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361634000, "topic": "Rob Davies - Enterprise deployments with Apache ActiveMQ", "start": "16:40", "speaker": "Rob Davies", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361636700, "type": "talk", "description": "<p>Apache ActiveMQ is one of the most popular messaging technologies in use today. This talk will explain some of the concepts behind enterprise deployments, like high availability, clustering and connectivity across wide area networks. An explain the usage of ActiveMQ in retail environments, the US Federal Aviation Authority, CERN and finance.</p>"}, {"end": "17:25", "room": "#Lecture room D3", "language": "EN", "tags": ["Core OS"], "timestamp": 1361634000, "topic": "Karel Klíč -  Serious Bugs First: Automatic Problem Management in Fedora", "start": "16:40", "speaker": "Karel Klíč", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361636700, "type": "talk", "description": "<p>Fedora would definitely benefit from having more bugs fixed, serious<br />bugs first.&nbsp; We are presenting a client-server system which<br />facilitates problem reporting, monitoring and fixing.&nbsp; The system<br />takes over many tasks that were previously performed by reporters,<br />quality assurance, and developers.&nbsp; This leads to a notable increase<br />in the overall quality of Fedora.<br /><br />Problems are automatically detected on users' computers via ABRT<br />client and reported to a Problem Tracker server in an anonymous form.<br />The server analyzes the user reports and sorts them by priority.<br />Package maintainers are asked to investigate top problems affecing<br />many users, and server assist them in the bug fixing.&nbsp; Server tracks<br />the overall quality of Fedora and actions can be made depending on the<br />course.<br /><br />https://retrace.fedoraproject.org/faf/</p>"}, {"end": "18:40", "room": "Hackfest Lab 2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361636400, "topic": "Mario Torre - Thermostat: an Open Source Instrumentation Tool for the Hotspot JVM", "start": "17:20", "speaker": "Mario Torre", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361641200, "type": "talk", "description": "<p>\"Thermostat is a new Instrumentation tool for the Hotspot JVM which is both scalable and extensible, and provides an out of the box solution for monitoring, diagnosing, profiling and controlling the JVM.<br /><br />Thermostat main goal is to be a distributed Instrumentation tool and aims to make easy to monitor the Java VM over a range of possible scenarios and use cases, from simple local applications to complex Cloud oriented PaaS stacks.<br /><br />In our presentation, we will describe our extensible model for collecting JVM and system monitoring data side by side, and attendees will learn about the features that make Thermostat unique over the alternatives.<br /><br />Thermostat features a variety of client and components, and expose a comprehensive plugin API.<br /><br />We will give an overview of this API and the architecture, and we will also describe our Eclipse plugin, the standalone Swing, the shell and the other command line clients. \"</p>"}, {"end": "18:40", "room": "Meeting point 2", "language": "EN", "tags": ["Core OS"], "timestamp": 1361636400, "topic": "Michal Minar, Radek Nováček, Jan Šafránek - Writing CIM providers", "start": "17:20", "speaker": "Michal Minar, Radek Nováček, Jan Šafránek", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361641200, "type": "talk", "description": "<p>Development of a simple CIM provider in python and C.<br />C will be covered in second part of the workshop and is optional.<br /><br />Required: some python knowledge, CIM overview (attend CIM talk on develconf)<br />Suggested: C knowledge</p>"}, {"end": "18:30", "room": "#Lecture room D1", "language": "EN", "tags": ["Kernel"], "timestamp": 1361637000, "topic": "Kernel lightning talks", "start": "17:30", "speaker": "Jiří Pirko, Jiří Benc, Zdeněk Kabeláč", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361640600, "type": "talk", "description": "<p>Jiri Benc - Precision Time Protocol / Jiri Pirko - Network Team driver project / Zdenek Kabelac - LVM swiss army knife</p>"}, {"end": "18:30", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361637000, "topic": "JBoss Ligthning talks", "start": "17:30", "speaker": "Koen Aers, Josef Cacek, Dan Allen, Tomáš Černý", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361640600, "type": "talk", "description": "<p>Josef Cacek - Get Kerberos authentication working in JBoss AS 7 &amp; EAP 6</p>\r\n<p>Dan Allen -&nbsp;Drop the angled brackets. Write (Ascii)Docs with Pleasure!</p>\r\n<p>Koen Aers - From Zero to JavaEE in 15 Minutes (or Less)</p>\r\n<p>Tomas Cerny - a Modern approach to UI Development - JFormBuilder library&nbsp;</p>"}, {"end": "18:30", "room": "#Lecture room D3", "language": "EN", "tags": ["Core OS"], "timestamp": 1361637000, "topic": "Core OS Lightning talks", "start": "17:30", "speaker": "Tomáš Mráz, Hans de Goede, Jan Fiedor", "location": "MUNI", "date": "2013-02-23", "timestamp_end": 1361640600, "type": "talk", "description": "<p>Tom&aacute;&scaron; Mr&aacute;z - libpwquality library / Hans de Goede - spice status update / Jan Fiedor (VUT) - ANaConDA: A Framework for Analysing Multi-threaded C/C&nbsp;&nbsp; Programs on the Binary Level</p>"}, {"end": "09:45", "room": "#Lecture room D1", "language": "EN", "tags": ["Core OS, Security"], "timestamp": 1361692800, "topic": "Steve Grubb - Executable Hardening Measures - How they work and/or don't", "start": "09:00", "speaker": "Steve Grubb", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361695500, "type": "talk", "description": "<p>This talk will go over all the protection mechanisms that are available to developers and package maintainers. This includes PIE, RELRO, gcc stack protector, and FORTIFY_SOURCE. It will explain what kind of attacks these prevent and how they work. More importantly, this talk will also go over limitations, short comings, and failures of these mechanisms. Some tools and techniques for analysis will be presented. The attendee will leave with a better understanding of how protected any given binary actually is.</p>"}, {"end": "09:45", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361692800, "topic": "David Hladký - Magnolia CMS - infrastructure behind www.jboss.org", "start": "09:00", "speaker": "David Hladký", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361695500, "type": "talk", "description": "<p>What is Magnolia and&nbsp; the Content management system? What can Magnolia do for your community project? Brief introduction JCR specification. Programming plugins to Magnolia CMS.</p>"}, {"end": "09:45", "room": "#Lecture room D3", "language": "EN", "tags": ["Networking"], "timestamp": 1361692800, "topic": "Pavel Šimerda - Evolution of Linux network management", "start": "09:00", "speaker": "Pavel Šimerda", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361695500, "type": "talk", "description": "<p>Network scripts were never good enough to support all sorts of dynamic network configurations. Various networking options are performed with various specialized daemons and they can't<br />really cooperate. This makes your network experience very limited. Our goal is to connect<br />all of these tools together to make dynamic networking feasible while supporting all sorts<br />of use cases including desktop, laptop, server, virtualization and even all of them at the<br />same time.</p>"}, {"end": "10:30", "room": "Hackfest Lab 1", "language": "EN", "tags": ["Kernel"], "timestamp": 1361692800, "topic": "Jonathan Brassow - Storage Management with LVM", "start": "09:00", "speaker": "Jonathan Brassow", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361698200, "type": "talk", "description": "<p>The Linux Logical Volume Manager (LVM) has added a number of new features in recent years, including updates to mirroring, snapshots, raid support and more.&nbsp; This lab will introduce attendees to the fundamental concepts in LVM and give hands-on experience with the latest features.</p>"}, {"end": "10:30", "room": "Hackfest Lab 2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361692800, "topic": "Radoslav Husar - All you wanted to know about JBoss AS clustering in a hands-on session", "start": "09:00", "speaker": "Radoslav Husar", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361698200, "type": "talk", "description": "<p>In the hands-on lab we will talk a little bit about AS 7 in general and challenges it poses to being Highly-Available (HA). Then we will look at the basic clustering concepts. We will code a simple but clustered Web application and then simulate deployment in a larger cluster. Simulating failover will demonstrate how robust clustering is. If time permits, we will take a look at how to roll updates in the cluster withouth downtime with mod_cluster. We will close the lab with Q</p>"}, {"end": "12:00", "room": "Meeting point 1", "language": "EN", "tags": ["Core OS"], "timestamp": 1361692800, "topic": "Honza Horak - PostgreSQL hackfest", "start": "09:00", "speaker": "Honza Horák", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361703600, "type": "talk", "description": "<p>TBD</p>"}, {"end": "14:00", "room": "Meeting point 2", "language": "EN", "tags": ["Documentation"], "timestamp": 1361692800, "topic": "Florian Nadge - Gnome Doc Sprint #3", "start": "09:00", "speaker": "GNOME Doc Sprint", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361710800, "type": "talk", "description": "N/A"}, {"end": "10:35", "room": "#Lecture room D1", "language": "EN", "tags": ["Cloud"], "timestamp": 1361695800, "topic": "Omer Frenkel - oVirt introduction - The virtual datacenter management platform", "start": "09:50", "speaker": "Omer Frenkel", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361698500, "type": "talk", "description": "<p>The oVirt Project is an open virtualization project for anyone who cares about Linux-based KVM virtualization. Providing a feature-rich server virtualization management system with advanced capabilities for hosts and guests, including high availability, live migration, storage management, system scheduler, and more.<br />This session provides a high level overview of the goals and architecture of the oVirt Project</p>"}, {"end": "10:35", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361695800, "topic": "Jiří Vaněk - Under the roof of JDK 8 ", "start": "09:50", "speaker": "Jiří Vaněk", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361698500, "type": "talk", "description": "<p>OpenJDK 8, after two years of Java 7, is getting close to it release - 2013/07/05.<br />This presentation is aimed to</p>\r\n<ul>\r\n<li>present the killer feature  - Lambda expressions</li>\r\n<li>description of smaller changes</li>\r\n<li>introduction of postponed (Java 9) project Jigsaw, which can still be compiled into OpenJDK 8 by those who wants.</li>\r\n</ul>"}, {"end": "10:35", "room": "#Lecture room D3", "language": "EN", "tags": ["Networking"], "timestamp": 1361695800, "topic": "Thomas Woerner - Dynamic firewall with firewalld", "start": "09:50", "speaker": "Thomas Woerner", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361698500, "type": "talk", "description": "<p>This talk describes firewalld and what a dynamic firewall is, the advantages compared to the static only firewall model with lokkit/system-config-firewall, the features of firewalld (zones, services, icmp types, runtime and persistent configuration, the D-BUS interface), also the configuration of firewalld and it's features, the direct interface and the interaction with other projects (NetworkManager, libvirt, etc.).</p>"}, {"end": "11:25", "room": "#Lecture room D1", "language": "EN", "tags": ["Cloud"], "timestamp": 1361698800, "topic": "Matthias Runge - Introduction to OpenStack", "start": "10:40", "speaker": "Matthias Runge", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361701500, "type": "talk", "description": "<p>OpenStack implements a full stack to provide an infrastructure as a service solution. <br />The stack is constructed by several different services introduced during the talk, notably OpenStack's dashboard. <br /><br />The audience will also introduced into OpenStacks development model and \"how to contribute to OpenStack\".</p>"}, {"end": "11:25", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361698800, "topic": "Ladislav Thon - The Dart programming language", "start": "10:40", "speaker": "Ladislav Thon", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361701500, "type": "talk", "description": "<p>Come to the Dart side! Let's take a look at a boring programming language and see what innovations does it bring to the mainstream field. We will be speaking big words like optional typing, isolates or mirrors -- but don't worry, I'm friendly and mostly harmless.</p>"}, {"end": "11:25", "room": "#Lecture room D3", "language": "EN", "tags": ["Networking"], "timestamp": 1361698800, "topic": "Thomas Graf - Open vSwitch on Fedora", "start": "10:40", "speaker": "Thomas Graf", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361701500, "type": "talk", "description": "<p>Over and implementation details of Open vSwitch. A virtual switch designed to be used in place of the existing Linux software bridge for virtualized server environments. It features support for several network management related industry standards such as OpenFlow, sFlow, and NetFlow. It also supports LACP, STP, and 802.1Q VLAN tagging.</p>"}, {"end": "12:10", "room": "Hackfest Lab 1", "language": "EN", "tags": ["Fedora"], "timestamp": 1361698800, "topic": "Will Foster - Free Yourself from Microsoft Exchange - Deploying Enterprise Open Source Collaboration Solutions using RHEV3, Zimbra and iSCSI", "start": "10:40", "speaker": "Will Foster", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361704200, "type": "talk", "description": "<p>In a fast-paced, always connected business world having just email doesn't cut it.&nbsp; There is a growing need for all-encompassing collaboration solutions, most people are not aware of other solutions or opt for Microsoft Exchange which can be quite expensive, tedious to manage and force unneeded vendor lock-in.</p>\r\n<p>Learn how Red Hat IT deploys and manages a secure, stable Open Source collaboration solution built on RHEV3, RHEL6, Zimbra and Netapp iSCSI storage which handles the explosive growth of Red Hat's business needs.</p>"}, {"end": "12:10", "room": "Hackfest Lab 2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361698800, "topic": "Koen Aers - Plugging into JBoss Forge", "start": "10:40", "speaker": "Koen Aers", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361704200, "type": "talk", "description": "<p>JBoss Forge is an incremental enhancement tool that lets you take an existing Java project and safely add in new functionality. Forge operates by means of plug-ins, each of them contributing one or more commands to do a particular task. <br />This session is a deep dive into JBoss Forge plug-in development. While we will show how to create such a plug-in, the purpose of the session is also to gather ideas for new and cool plug-ins. Come share your opinion and make sure Forge can be extended with the capabilities you would like. Maybe we can even develop it on the spot!</p>"}, {"end": "12:15", "room": "#Lecture room D1", "language": "EN", "tags": ["Cloud"], "timestamp": 1361701800, "topic": "Omer Frenkel - Supporting and Using EC2/CIMI on top of Cloud Environments", "start": "11:30", "speaker": "Omer Frenkel", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361704500, "type": "talk", "description": "<p>In this presentation I'll describe some standard and common cloud<br />APIs such as EC2 and CIMI, and show how one can use Deltacloud in<br />order to support them on top ofcloud environments. As an example, I'll<br />show how to add this support and use it on top of the oVirt engine.</p>"}, {"end": "12:15", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361701800, "topic": "Tomáš Hradec - Introduction to Ceylon", "start": "11:30", "speaker": "Tomáš Hradec", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361704500, "type": "talk", "description": "<p>Ceylon is a new programming language designed to execute on the JVM. We're fans of Java and its ecosystem. However, we think that the language and class libraries, designed more than 15 years ago, are no longer the best foundation for a range of today's business computing problems.<br />&nbsp;<br />Ceylon's design goals include:<br />&nbsp;<br />- easy to learn and understand for Java and C# developers<br />- eliminate some of Java's verbosity, but keep its readability<br />- improve upon Java's typesafety<br />- provide a declarative syntax for expressing hierarchical information (user interface, external data, system configuration)<br />- support and encourage a more functional style of programming with immutable objects and higher-order functions<br />- great support for meta-programming<br />- built-in modularity</p>"}, {"end": "12:15", "room": "#Lecture room D3", "language": "EN", "tags": ["Core OS"], "timestamp": 1361701800, "topic": "Lennart Poettering - What are we breaking now?", "start": "11:30", "speaker": "Lennart Poettering", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361704500, "type": "talk", "description": "<p>systemd is now more than 2 years old, and on after three releases of Fedora on its way into RHEL 7. In this talk we want to discuss some of more recent additions, and what is expected as further additions in the near future.</p>"}, {"end": "13:15", "room": "#Lecture room D1", "language": "EN", "tags": ["Cloud"], "timestamp": 1361705400, "topic": "Nikola ipanov - Openstack Nova Compute - The story of Python, Cloud and SOA", "start": "12:30", "speaker": "Nikola Đipanov", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361708100, "type": "talk", "description": "<p>OpenStack is a global collaboration of developers and cloud computing technologists<br />producing the open standard cloud operating system for both public and private cloud.<br /><br />OpenStack Compute project (code name - Nova) is OpenStack cloud controller part - a piece<br />of open source software in charge of managing a large network of virtual machines. It is<br />meant to be scalable, robust and hardware and hypervisor technology agnostic. It is also<br />written 100% in Python.<br /><br />This talk will give an overview of Nova functionality and also try to dig deeper into some<br />of it's design choices. It aims to give and overview of a sample architecture of a modern <br />distributed system written in Python.<br /><br />Finally - I will talk about where Nova as a project will go in the future, and how people can<br />get involved</p>"}, {"end": "13:15", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361705400, "topic": "Pavel Tišnovský - Clojure - a new hope for the Java platform?", "start": "12:30", "speaker": "Pavel Tišnovský", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361708100, "type": "talk", "description": "<p>This is talk about the very modern programming language with very old roots.</p>"}, {"end": "13:15", "room": "#Lecture room D3", "language": "EN", "tags": ["Core OS"], "timestamp": 1361705400, "topic": "Bryn M Reeves - Who moved my /usr?? - staying sane in a changing world", "start": "12:30", "speaker": "Bryn M Reeves", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361708100, "type": "talk", "description": "<p>The open source world sometimes seems to be an ever-changing flux of<br />software projects constantly waxing and waning. Bryn Reeves looks at<br />some recent and historic changes and considers ways that users,<br />testers and developers can stay sane while still keeping up-to-date<br />with bleeding edge development.</p>"}, {"end": "14:00", "room": "Hackfest Lab 1", "language": "EN", "tags": ["Desktop"], "timestamp": 1361705400, "topic": "Martin Stránský - Firefox/WebGL/HTML5/Emscripten", "start": "12:30", "speaker": "Martin Stránský", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361710800, "type": "talk", "description": "<p>Learn how to start coding in cool new web technologies like WebGL, HTML5, Emscripten etc. Use the best out of new Firefox</p>"}, {"end": "14:00", "room": "Hackfest Lab 2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361705400, "topic": "Towards a Smart, Automated User Interface Design", "start": "12:30", "speaker": "Tomáš Černý", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361710800, "type": "talk", "description": "<p>User interface (UI) development and maintenance presents a burden for many developers. Existing UI development approaches often restate information already captured in the application model such as entity attributes, validation, security, etc. Changes in application model often require many subsequent changes to the UI. Such duplication creates additional maintenance requirements for synchronization (at a minimum) and often is a source for errors (i.e., when model and UI disagree). Adding to the difficulties, typical UI implementations often tangle multiple concerns together such as presentation, validation, layout, security, etc. In our talk, we present our approach to deal with UI employing aspect-oriented design, code-base inspection and UI generation. Our approaches considerably reduces development and maintenance efforts and separates different concerns. Furthermore, it supports the design of Adaptive User Interfaces that adjust the UI to user's capabilities, skills, origin, rights, browsing device, etc. We provide a demonstration of a library JFormBuilder that utilizes our approach and is ready to use with your Java EE application.</p>"}, {"end": "14:05", "room": "#Lecture room D1", "language": "EN", "tags": ["Cloud"], "timestamp": 1361708400, "topic": "Antoni Segura Puimedon - oVirt Networking", "start": "13:20", "speaker": "Antoni Segura Puimedon", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361711100, "type": "talk", "description": "<p>This talk will give an overview of the networking model that is used by the open virtual datacenter management platform called oVirt. It will contain parts about the front-facing part as well as the backend.</p>"}, {"end": "14:05", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361708400, "topic": "Václav Pech - Pick the low-hanging concurrency fruit", "start": "13:20", "speaker": "Václav Pech", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361711100, "type": "talk", "description": "<p>Concurrency is not hard. It can actually feel natural and easy. Surprisingly little effort is required to achieve a great level of concurrency in your everyday code. Come and pick the fruit that hangs low, right above your head. Stretch out your hand and learn to use parallel collections, asynchronous functions, fork/join and dataflow variables. You can write code that runs fast on modern multi-core chips without dramatic impact on your applications' architecture. It will be deterministic and reliable. Come and get ready for the multi-core future.</p>"}, {"end": "14:05", "room": "#Lecture room D3", "language": "EN", "tags": ["Core OS"], "timestamp": 1361708400, "topic": "Daniel J Walsh - SECure Linux Application Container ", "start": "13:20", "speaker": "Daniel J Walsh", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361711100, "type": "talk", "description": "<p>This talk will cover using virt-sandbox package to create hundreds of secure application containers.&nbsp; It will explain how this uses libvirt-lxc, SELinux, CGroups and namespaces to create many different environments.</p>"}, {"end": "14:55", "room": "#Lecture room D1", "language": "EN", "tags": ["Cloud"], "timestamp": 1361711400, "topic": "Justin Clift - When Lightning Strikes Your Cloud - Using Aeolus to Failover from Amazon EC2 to OpenStack", "start": "14:10", "speaker": "Justin Clift", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361714100, "type": "talk", "description": "<p>Sudden Cloud outages seem to happen every few months, with no major<br />Cloud company successfully preventing them.<br /><br />Each time, well known companies and websites who \"should know better\"<br />are caught out.&nbsp; The cost is time, money, reputation, and trust.<br /><br />This Developer Conference presentation will show how to stay up when<br />Amazon's EC2 goes down.&nbsp; The setup and deployment of Linux applications<br />to EC2 will be demonstrated using Aeolus, and you will learn how to fail<br />them over to a public OpenStack cloud when trouble strikes -- quickly and<br />with minimal impact.<br /><br />This presentation will be of _serious interest_ to everyone who needs their<br />public cloud applications (running on Linux) to be resilient to cloud outages.<br /><br />**If you rely on just one public cloud, and you're looking for a way not to,<br />this is for you.**</p>"}, {"end": "14:55", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361711400, "topic": "Jiří Sviták - New Features in jBPM 6", "start": "14:10", "speaker": "Jiří Sviták", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361714100, "type": "talk", "description": "<p>The talk will cover new features in jBPM 6 business process suite, which combines Red Hat and Polymita technology. Main topics will be the business process simulation, the business activity monitoring and the new business central server.</p>"}, {"end": "14:55", "room": "#Lecture room D3", "language": "EN", "tags": ["Core OS"], "timestamp": 1361711400, "topic": "Lennart Poettering - The systemd Journal", "start": "14:10", "speaker": "Lennart Poettering", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361714100, "type": "talk", "description": "<p>The systemd Journal has been introduced with F18. In this talk I want to discuss the why?, the what? and the how?</p>"}, {"end": "15:40", "room": "Hackfest Lab 2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361711400, "topic": "Dominik Pospisil - JBoss AS7 domain management", "start": "14:10", "speaker": "Dominik Pospíšil", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361716800, "type": "talk", "description": "<p>JBoss Application Server 7 comes with domain configuration and management capabilities. The lab will start with introduction to related concepts and tools. Hands on session will follow covering basic management scenarios - starting, stopiing domain servers, configuring databases, jms resources, etc.</p>"}, {"end": "15:40", "room": "Meeting point 2", "language": "EN", "tags": ["Documentation"], "timestamp": 1361711400, "topic": "Eliska Slobodova & Jaromir Hradilek - Introduction to Publican ", "start": "14:10", "speaker": "Eliska Slobodova, Jaromir Hradilek", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361716800, "type": "talk", "description": "<p>Publican is a tool for easy documentation management. Publican not only builds documents for publication but can build and manage a documentation website as well. Use brands to apply a custom look, and style HTML and PDF output.</p>"}, {"end": "15:45", "room": "#Lecture room D1", "language": "EN", "tags": ["Cloud"], "timestamp": 1361714400, "topic": "Petr Blaho, Jiri Stransky - Designing RESTful APIs", "start": "15:00", "speaker": "Petr Blaho, Jiri Stransky", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361717100, "type": "talk", "description": "<p>Brief introduction into HTTP RESTful API design, plus some practical issues we hit when designing APIs for Aeolus project and how we solved them.</p>"}, {"end": "15:45", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361714400, "topic": "Rastislav Wagner - Cool and lost features in JBDS", "start": "15:00", "speaker": "Rastislav Wágner", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361717100, "type": "talk", "description": "<p>This presentation is focusing on various features which may not be visible for JBT/JBDS users at the first sight but they will undoubtedly help them during development of their applications.<br />During the session we will learn how to use maven source lookup for debugging. We will also deal with maven respositories and possibility to download runtimes directly from IDE and much more.</p>"}, {"end": "15:45", "room": "#Lecture room D3", "language": "EN", "tags": ["Core OS"], "timestamp": 1361714400, "topic": "Rainer Gerhards - Log Message Processing, Formatting and Normalizing with Rsyslog", "start": "15:00", "speaker": "Rainer Gerhards", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361717100, "type": "talk", "description": "<p>Log messages become ever more-important, both in commercial settings for legal reasons as well as basis for anomaly and fault detection. Gathering log messages from diverse sources and making sense out of them is a though task - especially at high message rates. In this talk, we will describe rsyslog's message processing and re-formatting capabilities. Most importantly, we will show that a current syslogd is not just a dumb \"file writing service\" but rather a highly flexible and powerful tool that can do much more than simple log file processing. For example, it can also be integrated into complex workflows and normalization solutions. The talk offers a theoretical understanding of the relevant rsyslog design as well as practical examples, based on real-world use cases.</p>"}, {"end": "16:35", "room": "#Lecture room D1", "language": "EN", "tags": ["Cloud"], "timestamp": 1361717400, "topic": "Lukáš Zapletal - Java loves Ruby: Katello on TorqueBox", "start": "15:50", "speaker": "Lukáš Zapletal", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361720100, "type": "talk", "description": "<p>Katello is cloud life-cycle systems management project written in Ruby on Rails. One of our side efforts is to port it to TorqueBox,&nbsp; Ruby application platform built on top of JBoss with support for services such as messaging, scheduling, caching, and daemons. Experiences with this proof-of-concept port, which is still in progress, are shared in this talk. English.</p>"}, {"end": "16:35", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361717400, "topic": "Viliam Ročkai, Marek Posolda - GateIn portal usecase", "start": "15:50", "speaker": "Viliam Ročkai, Marek Posolda", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361720100, "type": "talk", "description": "<p>Pros and cons of using GateIn portal as a platform for Java enterprise web applications. Example with practical usecase will be presented.</p>"}, {"end": "16:35", "room": "#Lecture room D3", "language": "EN", "tags": ["Quality Assurance"], "timestamp": 1361717400, "topic": "Miroslav Franc - Testing GNU Toolchain ", "start": "15:50", "speaker": "Miroslav Franc", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361720100, "type": "talk", "description": "<p><br />&nbsp; What can go wrong in low level userland?&nbsp; What is a bug?<br />&nbsp; What is its reproducer?&nbsp; Ideal case vs. harsh reality.</p>"}, {"end": "17:15", "room": "Hackfest Lab 2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361717400, "topic": "Stefan Bunciak, Vlado Pakan - Hybrid Mobile Applications development", "start": "15:50", "speaker": "Stefan Bunciak, Vlado Pakan", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361722500, "type": "talk", "description": "<p>Develop Hybrid Mobile Applications (mainly for Android) using HTML5/Apache Cordova and JBoss Developer Studio with Android Tools as an IDE.<br /><br />More at: https://community.jboss.org/wiki/AndroidLabSubjectProposal</p>"}, {"end": "17:25", "room": "#Lecture room D1", "language": "EN", "tags": ["Cloud"], "timestamp": 1361720400, "topic": "John M. Walker & Kaleb Keithley - Introduction to the Gluster Commmunity and Roadmap", "start": "16:40", "speaker": "John Mark Walker, Kaleb Keithley", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361723100, "type": "talk", "description": "<p>GlusterFS is a popular, software-only distributed storage system and the lynchpin of the Gluster community. In this talk, attendees will learn about the recent release of GlusterFS 3.4, what's new, and what is coming up on the roadmap. We'll demo some of the new features, including QEMU integration and developing applications using the Swift (from OpenStack) API.</p>"}, {"end": "17:25", "room": "#Lecture room D2", "language": "EN", "tags": ["JBoss"], "timestamp": 1361720400, "topic": "Dan Allen - Static is the new dynamic: Bake your HTML5 website with Awestruct", "start": "16:40", "speaker": "Dan Allen", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361723100, "type": "talk", "description": "<p>In the beginning of the web, there were only static HTML files. Then  came the age of the CMS. Now, with the ever increasing capabilities of  HTML5-based browsers, we can give the server a rest, put security  problems behind us and escape deployment hassles by returning to static  HTML(5) documents and shifting the dynamic behavior to the client. Not  only does that let you blog out of static hosting sites like GitHub  pages, it also means you can put more processing power into the  authoring tools.<br /> <br /> How do static site generators work? What are the benefits over  (server-side) CMSes? How can static be dynamic? How is it different from  before?<br /> <br /> In this session, you'll be introduced to static site generation, and in  particular, Awestruct, a Ruby-based tool for building and publishing  static websites. You'll discover how you can leverage a wide range of  lightweight markup languages such as Haml, Textile, Markdown and SASS,  and view-layer tools like jQuery, Bootstrap and CoffeeScript to keep  your source terse and DRY. We'll use Awestruct's extension pipeline to  setup a blog, add comments to your site or add analytic tracking scripts  to your pages, then build and publish the site to GitHub pages in a  single command. The talk will conclude by sharing real-world experience  collected by creating several large web sites powered by static site  generators.<br /> <br /> Just because the pages are static doesn't mean they can't be dynamic too. Get Awestruct and blog like a hacker!</p>"}, {"end": "17:25", "room": "#Lecture room D3", "language": "EN", "tags": ["JBoss"], "timestamp": 1361720400, "topic": "JBoss Ligthning talks", "start": "16:40", "speaker": "Jiří Vaněk, Jozef Chocholáček", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361723100, "type": "talk", "description": "<p>Jiri Vanek &ndash; IcedTea Web</p>\r\n<p>Jozef Chocholacek - JCR persistence for jBPM</p>\r\n<p>&nbsp;</p>"}, {"end": "18:30", "room": "#Lecture room D1", "language": "EN", "tags": ["Cloud"], "timestamp": 1361723400, "topic": "Cloud lightning talks", "start": "17:30", "speaker": "Michal Fojtik, Michal Petrucha, Adam Kliment, Anastasis Andronidis", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361727000, "type": "talk", "description": "<p>&nbsp;Michal Fojtik &ndash; Deltacloud 1.0&nbsp;</p>\r\n<p>Michal Petrucha - OI-Live: a live Linux swiss army knife&nbsp;</p>\r\n<p>Adam Kliment (virtualmaster) - Launching the Rocket (robotice)</p>\r\n<p>Anastasis Andronidis - Grid resource provisioning over cloud backends</p>"}, {"end": "18:30", "room": "#Lecture room D2", "language": "EN", "tags": ["Fedora"], "timestamp": 1361723400, "topic": "Fedora lightning talks", "start": "17:30", "speaker": "Jakub Steiner, Marek Grac, Ondej Stárek", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361727000, "type": "talk", "description": "<p>Jakub Steiner - Creating translatable animation with Blender / Marek Grac - How to turn off computer? (Data consistency) / Ondej Starek - SMake&nbsp; build tool (not only) for C</p>"}, {"end": "18:30", "room": "#Lecture room D3", "language": "EN", "tags": [], "timestamp": 1361723400, "topic": "Security lightning talks", "start": "17:30", "speaker": "Adam Tkac, Siddharth Sharma, Tomas Radej", "location": "MUNI", "date": "2013-02-24", "timestamp_end": 1361727000, "type": "talk", "description": "<p>Siddharth Sharma - Own The Box / Adam Tkac &ndash; BIND10 / Tomas Radej - Licensing + Licensing tool</p>"}]}